app/views/comments/_comments.html.erb

SELECT `comments`.* FROM `comments`
---
<h3> Comments </h3>
<% @temat.comments.each do |comment| %>