app/controllers/temats/comments_controller.rb

SELECT  `temats`.* FROM `temats` WHERE `temats`.`id` = 24 LIMIT 1
---
    def set_commentable
      @commentable = Temat.find(params[:temat_id])