app/controllers/temats_controller.rb

  def index
    @temat = Temat.all
---
SELECT `temats`.* FROM `temats`

  def show
    @temat = Temat.find(params[:id])
---
SELECT  `temats`.* FROM `temats` WHERE `temats`.`id` = 1 LIMIT 1

  def spis
    @temats = Temat.all
---
SELECT `temats`.* FROM `temats`

  def create
    @temat = Temat.new(temat_params)
    respond_to do |format|
      if @temat.save
---
INSERT INTO `temats` (`created_at`, `updated_at`, `title`, `description`) VALUES ('2017-02-03 13:47:29', '2017-02-03 13:47:29', 'moj temat', 'jakis temat')

  def update
    respond_to do |format|
      if @temat.update(temat_params)
---
UPDATE `temats` SET `description` = 'Lubie naleśnika', `updated_at` = '2017-02-07 20:50:56' WHERE `temats`.`id` = 5

  def destroy
    @temat.destroy
---
DELETE FROM `temats` WHERE `temats`.`id` = 1

    def set_temat
      @temat = Temat.find(params[:id])
---
SELECT  `temats`.* FROM `temats` WHERE `temats`.`id` = NULL LIMIT 1